trade_exp/src/Documents/РасходныйКассовыйОрдер/РасходныйКассовыйОрдер.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>РасходныйКассовыйОрдер</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>РаспоряжениеНаПеремещениеДенежныхСредств</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>БанковскийСчет</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПоДокументу</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НомерВедомостиНаВыплатуЗарплаты</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>11</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ОплатаПоЗаявкам</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СтатьяДвиженияДенежныхСредств</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Ведомость</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ПодотчетноеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КассаККМ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВалютаКонвертации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаАвансовогоОтчета</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КурсКонвертации</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ДатаВедомостиНаВыплатуЗарплаты</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ЗаявкаНаРасходованиеДенежныхСредств</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Выдать</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Основание</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ГлавныйБухгалтер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Касса</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Кассир</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Приложение</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>КассаПолучатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОрганизацияПолучатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a02018f9-2167-4f30-9460-2404f9073282">
    <name>СуммаКонвертации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e146bd7e-5c8f-4860-a9a8-3740ef9dd2b4">
    <name>НалогообложениеНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8ca1ad0a-1dfb-4ab3-a288-3dd96451b6d1">
    <name>ГруппаФинансовогоУчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="738e6e6e-5726-45cd-8e95-29d4a7904ddc">
    <name>НаправлениеДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a92aa365-b59e-4548-b9c8-d8d5f4561fc4">
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a6055b9e-aa45-4c3c-9d5f-950a8070b1b9">
    <name>НеКонтролироватьЗаполнениеЗаявки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3be2d25d-a11f-4701-bf2e-8f8608322fcf">
    <name>ПроводкиПоРаботникам</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8d76d7b0-7e3f-4f73-83e0-087f36bddafe">
    <name>КратностьКурсаКонвертации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="73a6e887-3089-4430-9132-3c1afb647f82">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>РасшифровкаПлатежа</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>СтатьяДвиженияДенежныхСредств</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДоговорЗаймаСотруднику</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>10</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Партнер</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ВалютаВзаиморасчетов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Организация</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ЗаявкаНаРасходованиеДенежныхСредств</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СтатьяРасходов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>НаправлениеДеятельности</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>АналитикаАктивовПассивов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДоговорКредитаДепозита</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СуммаВзаиморасчетов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ТипСуммыКредитаДепозита</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>АналитикаРасходов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="3e5fd77e-9e36-4bc2-9c3b-29d7ecd94eab">
      <name>ТипПлатежаПоАренде</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>10</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="228a5658-3505-4327-adaa-b151b1f4e321">
      <name>ДоговорАренды</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>10</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="a8fd9715-38bb-4052-8785-9f3ae25505b2">
      <name>ОбъектРасчетов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="b5da41cc-969f-4499-9e2b-5ab2a3eefb72">
      <name>НастройкаСчетовУчета</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>10</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="8628ba42-6847-4cfe-85e0-7a9d74d8ea9b">
      <name>КурсЧислительВзаиморасчетов</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>4</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="27e31ab1-21a5-4cdd-a385-57c5666c4ee1">
      <name>КурсЗнаменательВзаиморасчетов</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>4</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="125f1369-a7d8-4e48-b3be-64ea2cd867a4">
    <name>ВыплатаЗаработнойПлаты</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="f77031b0-7fbc-4e72-94cd-1ab3238c9222">
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="8cc94099-da64-4f75-bd18-e0752a6e05ad">
      <name>ФизическоеЛицо</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="242c4432-7cae-48a7-8042-10d19ecc1ed6">
    <name>ДополнительныеРеквизиты</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="c43ecc08-a6bf-40b0-be1c-dceb4ec6a8dd">
      <name>ТекстоваяСтрока</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="70171c96-c9ec-4c0b-aca7-7daa4ea4b178">
      <name>Свойство</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="2032356b-c33d-4a99-baa7-874631c49613">
      <name>Значение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/Documents/РасходныйКассовыйОрдер/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ЗаполнитьСтатьюДДС(Объект) Экспорт
	
	Если Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВыдачаДенежныхСредствПодотчетнику Тогда
		
		ЗаполнитьТЧРасшифровка(Объект, Статья_ВыдачаВПодотчет());
		
	ИначеЕсли Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВыплатаЗарплатыЧерезКассу Тогда
		
		Если Объект.СтатьяДвиженияДенежныхСредств <> Статья_ДепонированнаяЗаработнаяПлата() Тогда
			Объект.СтатьяДвиженияДенежныхСредств = Статья_ВыплатаЗаработнойПлатыИзКассы();
		КонецЕсли;
		
	ИначеЕсли Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПрочаяВыдачаДенежныхСредств Тогда
		
		Если НЕ СтатьяРасходов_ПрочиеРасчетыСРазнымиДебиторамиИКредиторами(Объект) Тогда
			ЗаполнитьТЧРасшифровка(Объект, Статья_РасчетыСПерсоналомПрочий73());
		КонецЕсли;
		
	ИначеЕсли Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратОплатыКлиенту Тогда
		
		Если ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.АрендаНоменклатурыВозврат") Тогда
			Объект.СтатьяДвиженияДенежныхСредств = Статья_ВозвратОбеспечительногоПлатежаЗаАрендуНоменклатуры();
			ЗаполнитьТЧРасшифровка(Объект, Объект.СтатьяДвиженияДенежныхСредств);
		Иначе
			ЗаполнитьТЧРасшифровка(Объект, Статья_ВозвратФизическомуЛицу());
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция СтатьяРасходов_ПрочиеРасчетыСРазнымиДебиторамиИКредиторами(Объект) Экспорт
	
	Если ЗначениеЗаполнено(Объект.РасшифровкаПлатежа) И
		Объект.РасшифровкаПлатежа[0].СтатьяРасходов = ПВХСтатьиАктивовПассивов_ПрочиеРасчетыСРазнымиДебиторамиИКредиторами() Тогда
		
		ЗаполнитьТЧРасшифровка(Объект, Статья_РасчетыСПерсоналомПрочий76());
		Возврат Истина;
	КонецЕсли;  
	
	Возврат Ложь;
	
КонецФункции

Функция Статья_ВыдачаВПодотчет()
	Возврат Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоКоду("0А-000013"); // ВЫДАЧА В ПОДОТЧЕТ
КонецФункции

Функция Статья_ДепонированнаяЗаработнаяПлата()
	Возврат Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоКоду("01-000007"); // Депонированная заработная плата (76.04)
КонецФункции

Функция Статья_ВыплатаЗаработнойПлатыИзКассы()
	Возврат Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоКоду("0А-000087"); // ЗАРАБОТНАЯ ПЛАТА / Выплата заработной платы из кассы
КонецФункции                               

Функция Статья_РасчетыСПерсоналомПрочий76()
	Возврат Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоКоду("0А-000188"); // Расчеты с персоналом прочий (76.10)
КонецФункции                         

Функция Статья_РасчетыСПерсоналомПрочий73() Экспорт
	Возврат Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоКоду("0А-000091"); // Расчеты с персоналом прочий (73)
КонецФункции 

Функция Статья_ВозвратОбеспечительногоПлатежаЗаАрендуНоменклатуры()
	Возврат Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоКоду("0А-000193"); // Возврат обеспечительного платежа за аренду номенклатуры
КонецФункции        

Функция Статья_ВозвратФизическомуЛицу()
	Возврат Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоКоду("0А-000015"); // ВОЗВРАТ ФИЗИЧЕСКОМУ ЛИЦУ
КонецФункции    

Функция ПВХСтатьиАктивовПассивов_ПрочиеРасчетыСРазнымиДебиторамиИКредиторами()
	Возврат ПланыВидовХарактеристик.СтатьиАктивовПассивов.НайтиПоКоду("0А-00000005"); // Прочие расчеты с разными дебиторами и кредиторами (76.10)
КонецФункции      

Процедура ЗаполнитьТЧРасшифровка(Объект, Статья) Экспорт
	Для Каждого стрРасшировка Из Объект.РасшифровкаПлатежа Цикл
		стрРасшировка.СтатьяДвиженияДенежныхСредств = Статья;
	КонецЦикла;
КонецПроцедуры

#КонецЕсли
